emsesp/EMS-ESP32/src/system.cpp
        JsonArray analogJson = node.createNestedArray("analogs");
        for (const AnalogCustomization & sensor : settings.analogCustomizations) {
            JsonObject sensorJson = analogJson.createNestedObject();
            sensorJson["gpio"]    = sensor.id;
            sensorJson["name"]    = sensor.name;
            if (EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX) {
                sensorJson["type"] = sensor.type;
            } else {
                sensorJson["type"] = FL_(enum_sensortype)[sensor.type];
            }
            if (sensor.type == AnalogSensor::AnalogType::ADC) {
                sensorJson["offset"] = sensor.offset;
                sensorJson["factor"] = sensor.factor;
                sensorJson["uom"]    = EMSdevice::uom_to_string(sensor.uom);
            }
        }

        // exclude entities
        JsonArray exclude_entitiesJson = node.createNestedArray("exclude_entities");
        for (const auto & entityCustomization : settings.entityCustomizations) {
            JsonObject entityJson    = exclude_entitiesJson.createNestedObject();
            entityJson["product_id"] = entityCustomization.product_id;
            entityJson["device_id"]  = entityCustomization.device_id;

            JsonArray exclude_entityJson = entityJson.createNestedArray("entity_ids");
            for (uint8_t entity_id : entityCustomization.entity_ids) {
                exclude_entityJson.add(entity_id);
            }
        }
    });

    return true;
}

// export status information including the device information
// http://ems-esp/api/system/info
bool System::command_info(const char * value, const int8_t id, JsonObject & output) {
    JsonObject node;

    // System
    node = output.createNestedObject("System");

    node["version"]          = EMSESP_APP_VERSION;
    node["uptime"]           = uuid::log::format_timestamp_ms(uuid::get_uptime_ms(), 3);
    node["uptime (seconds)"] = uuid::get_uptime_sec();

#ifndef EMSESP_STANDALONE
    node["freemem"] = ESP.getFreeHeap() / 1000L; // kilobytes
#endif
    node["reset reason"] = EMSESP::system_.reset_reason(0) + " / " + EMSESP::system_.reset_reason(1);

    if (EMSESP::dallas_enabled()) {
        node["temperature sensors"] = EMSESP::dallassensor_.no_sensors();
    }

    if (EMSESP::analog_enabled()) {
        node["analog sensors"] = EMSESP::analogsensor_.no_sensors();
    }

#ifndef EMSESP_STANDALONE
    // Network
    node = output.createNestedObject("Network");
    if (WiFi.status() == WL_CONNECTED) {
        node["connection"]      = F("WiFi");
        node["hostname"]        = WiFi.getHostname();
        node["SSID"]            = WiFi.SSID();
        node["BSSID"]           = WiFi.BSSIDstr();
        node["RSSI"]            = WiFi.RSSI();
        node["MAC"]             = WiFi.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(WiFi.localIP()) + "/" + uuid::printable_to_string(WiFi.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(WiFi.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(WiFi.dnsIP());
        if (WiFi.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(WiFi.localIPv6());
        }
    } else if (EMSESP::system_.ethernet_connected()) {
        node["connection"]      = F("Ethernet");
        node["hostname"]        = ETH.getHostname();
        node["MAC"]             = ETH.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(ETH.localIP()) + "/" + uuid::printable_to_string(ETH.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(ETH.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(ETH.dnsIP());
        if (ETH.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(ETH.localIPv6());
        }
    }
#endif

    // Status
    node = output.createNestedObject("Status");

    switch (EMSESP::bus_status()) {
    case EMSESP::BUS_STATUS_OFFLINE:
        node["bus status"] = (F("disconnected"));
        break;
    case EMSESP::BUS_STATUS_TX_ERRORS:
        node["bus status"] = (F("connected, tx issues - try a different tx-mode"));
        break;
    case EMSESP::BUS_STATUS_CONNECTED:
    default:
        node["bus status"] = (F("connected"));
        break;
    }

    if (EMSESP::bus_status() != EMSESP::BUS_STATUS_OFFLINE) {
        node["bus protocol"]                = EMSbus::is_ht3() ? F("HT3") : F("Buderus");
        node["bus telegrams received (rx)"] = EMSESP::rxservice_.telegram_count();
        node["bus reads (tx)"]              = EMSESP::txservice_.telegram_read_count();
        node["bus writes (tx)"]             = EMSESP::txservice_.telegram_write_count();
        node["bus incomplete telegrams"]    = EMSESP::rxservice_.telegram_error_count();
        node["bus reads failed"]            = EMSESP::txservice_.telegram_read_fail_count();
        node["bus writes failed"]           = EMSESP::txservice_.telegram_write_fail_count();
        node["bus rx line quality"]         = EMSESP::rxservice_.quality();
        node["bus tx line quality"]         = (EMSESP::txservice_.read_quality() + EMSESP::txservice_.read_quality()) / 2;
        if (Mqtt::enabled()) {
            node["MQTT status"]        = Mqtt::connected() ? F_(connected) : F_(disconnected);
            node["MQTT publishes"]     = Mqtt::publish_count();
            node["MQTT publish fails"] = Mqtt::publish_fails();
        }
        node["temperature sensors"] = EMSESP::dallassensor_.no_sensors();
        if (EMSESP::dallas_enabled()) {
            node["temperature sensor reads"] = EMSESP::dallassensor_.reads();
            node["temperature sensor fails"] = EMSESP::dallassensor_.fails();
        }
        node["analog sensors"] = EMSESP::analogsensor_.no_sensors();
        if (EMSESP::analog_enabled()) {
            node["analog sensor reads"] = EMSESP::analogsensor_.reads();
            node["analog sensor fails"] = EMSESP::analogsensor_.fails();
        }
        node["API calls"] = WebAPIService::api_count();
        node["API fails"] = WebAPIService::api_fails();

#ifndef EMSESP_STANDALONE
        if (EMSESP::system_.syslog_enabled_) {
            node["syslog started"] = syslog_.started();
            node["syslog level"]   = FL_(enum_syslog_level)[syslog_.log_level() + 1];
            node["syslog ip"]      = syslog_.ip();
            node["syslog queue"]   = syslog_.queued();
        }
#endif
    }

    // Devices - show EMS devices
    JsonArray devices = output.createNestedArray("Devices");
    for (const auto & device_class : EMSFactory::device_handlers()) {
        for (const auto & emsdevice : EMSESP::emsdevices) {
            if ((emsdevice) && (emsdevice->device_type() == device_class.first)) {
                JsonObject obj  = devices.createNestedObject();
                obj["type"]     = emsdevice->device_type_name();
                obj["name"]     = emsdevice->to_string();
                obj["entities"] = emsdevice->count_entities();
                char result[200];
                (void)emsdevice->show_telegram_handlers(result, EMSdevice::Handlers::RECEIVED);
                if (result[0] != '\0') {
                    obj["handlers received"] = result; // don't show handlers if there aren't any
                }
                (void)emsdevice->show_telegram_handlers(result, EMSdevice::Handlers::FETCHED);
                if (result[0] != '\0') {
                    obj["handlers fetched"] = result;
                }
                (void)emsdevice->show_telegram_handlers(result, EMSdevice::Handlers::PENDING);
                if (result[0] != '\0') {
                    obj["handlers pending"] = result;
                }
            }
        }
    }

